---
kind: type
id: T:Autodesk.Revit.Exceptions.AccessDeniedException
source: html/f280ddf5-9f59-eca8-634e-ace30de1f4bb.htm
---
# Autodesk.Revit.Exceptions.AccessDeniedException

## Syntax (C#)
```csharp
[SerializableAttribute]
public class AccessDeniedException : ApplicationException
```